Revit 2027 API
ParameterTypeId.RoofFacesLocation Property
 "Picked Faces Location"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofFacesLocation { get; }
Public Shared ReadOnly Property RoofFacesLocation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofFacesLocation {
	ForgeTypeId^ get ();
}
static member RoofFacesLocation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace